Tekla.Structures.Filtering.Categories.SurfaceFilterExpressions.Type
The Type class represents the type filter expression.

Tekla.Structures.Filtering.Categories.SurfaceFilterExpressions.Type.#ctor
Initializes a new instance of the Type class.